# Table Of Content
- Fase 1

# Fase 1
## Introduction
### First dataset
For this Project we will use several dataset

The first is about the poulation by city

In [1]:
import pandas as pd
raw = pd.read_csv('./Data/PopulationByCity.csv')
raw.head()

            city state  population      lat       lng
0   Anchor Point    AK      2057.0  59.7703 -151.7052
1      Anchorage    AK    253421.0  61.1508 -149.1091
2         Barrow    AK      4178.0      NaN       NaN
3       Big Lake    AK      3136.0  61.5260 -149.9721
4  Copper Center    AK       397.0  61.9845 -145.3544

In [2]:
raw.population.isna().sum()

0

In [3]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2832 entries, 0 to 2831
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   city        2832 non-null   object
 1   state       2832 non-null   object
 2   population  2832 non-null   float64
 3   lat         2228 non-null   float64
 4   lng         2228 non-null   float64
dtypes: float64(3), object(2)
memory usage: 110.8+ KB

In [4]:
data = raw.groupby('state')['population'].sum()
data

state
AK      387478.0
AL     2750534.0
AR     1616531.0
AZ     8250903.0
CA    49249138.0
CO     6137597.0
CT     2967945.0
DC     5289420.0
DE      295004.0
FL    21810103.0
GA     8419735.0
HI      944100.0
IA     1444472.0
ID     1144727.0
IL    10804913.0
IN     3721040.0
KS     1490641.0
KY     1735527.0
LA     3595868.0
MA     5531064.0
MD     3516636.0
ME      358554.0
MI     6441152.0
MN     4363323.0
MO     5369950.0
MS     1164017.0
MT      449445.0
NC     6475339.0
ND      256568.0
NE     1204252.0
NH      280697.0
NJ     2601111.0
NM     1493940.0
NV     3345225.0
NY    30512911.0
OH     8508297.0
OK     2763420.0
OR     3808109.0
PA    10533757.0
RI     1294305.0
SC     3012460.0
SD      310853.0
TN     4735520.0
TX    25148150.0
UT     3429680.0
VA     5061633.0
VT      145702.0
WA     7471759.0
WI     3649093.0
WV      790762.0
WY      242128.0
Name: population, dtype: float64

In [5]:
index = raw.state.unique()

In [6]:
df = pd.DataFrame(data=data, index=index)

In [7]:
df.columns = ['Population']
df.head()

    Population
AK    387478.0
AL   2750534.0
AR   1616531.0
AZ   8250903.0
CA  49249138.0

### Second dataset

In [8]:
with open('./Data/PercentagePeopleBelowPovertyLevel.csv', encoding="utf8", errors='ignore') as f:
    raw_1 = pd.read_csv(f)
raw_1.head()

  Geographic Area             City poverty_rate
0              AL       Abanda CDP         78.8
1              AL   Abbeville city         29.1
2              AL  Adamsville city         25.5
3              AL     Addison town         30.7
4              AL       Akron town           42

In [9]:
raw_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29329 entries, 0 to 29328
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Geographic Area  29329 non-null  object
 1   City             29329 non-null  object
 2   poverty_rate     29329 non-null  object
dtypes: object(3)
memory usage: 687.5+ KB

In [10]:
raw_1.isna().sum()

Geographic Area    0
City               0
poverty_rate       0
dtype: int64

In [11]:
raw_1.loc[(raw_1['poverty_rate'] == '-')]

      Geographic Area              City poverty_rate
573                AL       Whatley CDP            -
608                AK  Attu Station CDP            -
632                AK       Chicken CDP            -
637                AK       Chisana CDP            -
662                AK      Dot Lake CDP            -
...               ...               ...          ...
29261              WY        Oakley CDP            -
29266              WY     Owl Creek CDP            -
29273              WY  Powder River CDP            -
29289              WY     Ryan Park CDP            -
29304              WY    Table Rock CDP            -

[201 rows x 3 columns]

TypeError: can only concatenate str (not "int") to str

In [12]:
import numpy as np
replace =raw_1.replace('-', np.nan)

In [13]:
replace.loc[(raw_1['poverty_rate'] == '-')]

      Geographic Area              City poverty_rate
573                AL       Whatley CDP          NaN
608                AK  Attu Station CDP          NaN
632                AK       Chicken CDP          NaN
637                AK       Chisana CDP          NaN
662                AK      Dot Lake CDP          NaN
...               ...               ...          ...
29261              WY        Oakley CDP          NaN
29266              WY     Owl Creek CDP          NaN
29273              WY  Powder River CDP          NaN
29289              WY     Ryan Park CDP          NaN
29304              WY    Table Rock CDP          NaN

[201 rows x 3 columns]

In [14]:
# replace.groupby('Geographic Area')['poverty_rate'].sum()
refill = replace['poverty_rate'].astype(float)

In [15]:
lista_stati = raw.state.unique()
lista_stati

array(['AK', 'AL', 'AR', 'AZ', 'CA', 'CO', 'CT', 'DC', 'DE', 'FL', 'GA',
       'HI', 'IA', 'ID', 'IL', 'IN', 'KS', 'KY', 'LA', 'MA', 'MD', 'ME',
       'MI', 'MN', 'MO', 'MS', 'MT', 'NC', 'ND', 'NE', 'NH', 'NJ', 'NM',
       'NV', 'NY', 'OH', 'OK', 'OR', 'PA', 'RI', 'SC', 'SD', 'TN', 'TX',
       'UT', 'VA', 'VT', 'WA', 'WI', 'WV', 'WY'], dtype=object)

In [32]:
refill.sum()

478979.5

In [37]:
replace.groupby('Geographic Area')['poverty_rate']

In [33]:
my_list=[]
# for i in lista_stati:
replace = replace.loc[replace['Geographic Area']=='AL']
# print(i)
print(replace)
print(len(replace))
print(refill.sum())
refill = replace['poverty_rate'].astype(float)
# result = (refill.sum()/len(replace))
# my_list.append(result)
my_list.append(refill.sum()/len(replace))
my_list

Empty DataFrame
Columns: [Geographic Area, City, poverty_rate]
Index: []
0
0.0

C:\Users\User\AppData\Local\Temp/ipykernel_16616/1001318525.py:11: RuntimeWarning: invalid value encountered in double_scalars
  my_list.append(refill.sum()/len(replace))

[nan]

### Third Dataset

In [40]:
with open('./Data/MedianHouseholdIncome2015.csv', encoding="utf8", errors='ignore') as f:
    raw_2 = pd.read_csv(f)
raw_2.head()

  Geographic Area             City Median Income
0              AL       Abanda CDP         11207
1              AL   Abbeville city         25615
2              AL  Adamsville city         42575
3              AL     Addison town         37083
4              AL       Akron town         21667

In [41]:
raw_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29322 entries, 0 to 29321
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Geographic Area  29322 non-null  object
 1   City             29322 non-null  object
 2   Median Income    29271 non-null  object
dtypes: object(3)
memory usage: 687.4+ KB

In [64]:
to_convert = raw_2['Median Income']
converted = pd.to_numeric(to_convert, errors='coerce')
converted

0        11207.0
1        25615.0
2        42575.0
3        37083.0
4        21667.0
          ...
29317        NaN
29318    41523.0
29319    77114.0
29320    37500.0
29321        NaN
Name: Median Income, Length: 29322, dtype: float64

In [50]:
raw_2.isna().sum()

Geographic Area     0
City                0
Median Income      51
dtype: int64

## 4° DataSet

In [4]:
import pandas as pd
with open('./Data/PercentOver25CompletedHighSchool.csv', encoding="utf8", errors='ignore') as f:
    raw = pd.read_csv(f)
raw

      Geographic Area                    City percent_completed_hs
0                  AL              Abanda CDP                 21.2
1                  AL          Abbeville city                 69.1
2                  AL         Adamsville city                 78.9
3                  AL            Addison town                 81.4
4                  AL              Akron town                 68.6
...               ...                     ...                  ...
29324              WY  Woods Landing-Jelm CDP                  100
29325              WY            Worland city                 85.6
29326              WY             Wright town                 89.2
29327              WY              Yoder town                 79.4
29328              WY           Y-O Ranch CDP                  100

[29329 rows x 3 columns]

In [5]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29329 entries, 0 to 29328
Data columns (total 3 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Geographic Area       29329 non-null  object
 1   City                  29329 non-null  object
 2   percent_completed_hs  29329 non-null  object
dtypes: object(3)
memory usage: 687.5+ KB

In [6]:
to_convert = raw['percent_completed_hs']
converted = pd.to_numeric(to_convert, errors='coerce')
converted

0         21.2
1         69.1
2         78.9
3         81.4
4         68.6
         ...
29324    100.0
29325     85.6
29326     89.2
29327     79.4
29328    100.0
Name: percent_completed_hs, Length: 29329, dtype: float64

In [8]:
import pandas as pd
with open('./Data/ShareRaceByCity.csv', encoding="utf8", errors='ignore') as f:
    raw = pd.read_csv(f)
raw

,Geographic area,City,share_white,share_black,share_native_american,share_asian,share_hispanic
0,AL,Abanda CDP,67.2,30.2,0,0,1.6
1,AL,Abbeville city,54.4,41.4,0.1,1,3.1
2,AL,Adamsville city,52.3,44.9,0.5,0.3,2.3
3,AL,Addison town,99.1,0.1,0,0.1,0.4
4,AL,Akron town,13.2,86.5,0,0,0.3
...,...,...,...,...,...,...,...
29263,WY,Woods Landing-Jelm CDP,95.9,0,0,2.1,0
29264,WY,Worland city,89.9,0.3,1.3,0.6,16.6
29265,WY,Wright town,94.5,0.1,1.4,0.2,6.2
29266,WY,Yoder town,97.4,0,0,0,4
29267,WY,Y-O Ranch CDP,92.8,1.5,2.6,0,11.8

In [10]:
to_convert = raw['share_white']
converted = pd.to_numeric(to_convert, errors='coerce')
converted

0        67.2
1        54.4
2        52.3
3        99.1
4        13.2
         ...
29263    95.9
29264    89.9
29265    94.5
29266    97.4
29267    92.8
Name: share_white, Length: 29268, dtype: float64

In [9]:
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 29268 entries, 0 to 29267
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Geographic area        29268 non-null  object
 1   City                   29268 non-null  object
 2   share_white            29268 non-null  object
 3   share_black            29268 non-null  object
 4   share_native_american  29268 non-null  object
 5   share_asian            29268 non-null  object
 6   share_hispanic         29268 non-null  object
dtypes: object(7)
memory usage: 1.6+ MB